# 변수생성(자료형 자동배정)
# a = '안녕하세요'
# b = 1
# c = 3

# 리스트 생성
# a = []
# b = [1,2,3]
# c = ['life','is','too','short']

# 리스트 인덱싱
# a[0] = a 리스트 첫번째
# a[-1]= 리스트 마지막 값

# 리스트 슬라이싱
# a = [1,2,3,4,5]
# a[0:2] -> 1, 2 -> 마지막 전 리스트까지 포함
# a[:2] == [0:2]
# a[2:] -> 3 , 4, 5  2부터 끝까지

# 리스트 삭제
# del a[1] 1번 배열 리스트 값 삭제

# 리스트 요소추가
# a.append([5,6])
# a -> [1,3,4,[5,6]]

# 리스트 위치반환
# a = [1,2,3]
# a.index(3) -> 2 (3번 값이 들어있는 2번 배열을 돌려줌)

# 튜플 추가생성, 삭제 , 수정 불가능
# t1 = (1,2,'a','b')

# 딕셔너리 생성 key 값 name,phone을 통해 value 값 가져옴
# dic = {'name' : 'pey', 'phone':'01000000000'}
# print( dic['name']) -> pey


# 문자열 작음 따옴표 입력한다면
# food = "Python 's favorite food is perl"  큰 따움표로 감싸기 반대로 큰따움표 사용하려면 작은 따옴표로 감싸기

# 입력
# a = input("~~~~~~~~~~")




